#include<stdio.h>

int main()
{
	int i, j, m, n, x, y;
	/*
	for(i = 1; i < 168 / 2 + 1; i++)
	{
		if(168 % i == 0)
		{
			j = 168 / i;
			if(i > j && (i + j) % 2 == 0 && (i - j) % 2 == 0)
			{
				m = (i + j) / 2;
				n = (i - j) / 2;
				x = n * n - 100;
				printf("%d + 100 = %d * %d\n", x, n, n);
				printf("%d + 268 = %d * %d\n", x, m, m);
			}
		}
	}
	*/

	/*	
	 	设此数为x
	 	1、则：x + 100 = n^2, x + 100 + 168 = m^2
		2、计算等式：m^2 - n^2 = (m + n)(m - n) = 168
		3、设: m + n = i，m - n = j，则i * j = 168，因为奇*奇=奇 奇*偶=偶 偶*偶=偶，又因i * j = 168，所以i 和 j 至少一个是偶数。
		4、可得：m = (i + j) / 2， n = (i - j) / 2，因为x是整数，所以i 和 j 要么都是偶数，要么都是奇数。
		5、从 3 和 4 可推出 i 与 j 均是大于等于 2 的偶数。
		6、由于 i * j = 168， j>=2，则 i的取值范围为 2 <= i <= 84。
		7、接下来将 i 的所有数字循环计算即可。
	*/

	printf("原数\t\t加100\t\t再加168\n");
	for(i = 2; i <= 84; i += 2)
	{
		if(168 % i == 0)/* % 表示取余*/
		{
			j = 168 / i;
			if(i > j && (i + j) % 2 == 0 && (i - j) % 2 ==0)
			{
				m = (i + j) / 2;
				n = (i - j) / 2;
				x = n * n - 100;
				//printf("原数\t加100\t再加168\n");
				printf("%d\t\t%d=%d^2\t%d=%d^2\n", x, x+100, n, x+268, m);
				//printf("%d\n", x);
			}
		}
	}

	return 0;
}
